ITHACA-FV/tutorials/CFD/21unsteadyNSTurb_RBF/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "50";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11644
(
1.99511e-05
1.85069e-05
1.85071e-05
1.85072e-05
1.85072e-05
1.85071e-05
1.85072e-05
1.85069e-05
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2e-05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           nonuniform List<scalar> 
40
(
1.22518e-05
1.38747e-06
1.11428e-06
1.35594e-06
9.10229e-06
0.000160052
0.00101384
0.00254166
...
)
;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            zeroGradient;
    }
    cylinder1
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
