ITHACA-FV/tutorials/CFD/21unsteadyNSTurb_RBF/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "50";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11644
(
0.0808076
0.0810239
0.081459
0.0821186
0.0830104
0.0841428
0.0855232
0.0871567
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            zeroGradient;
    }
    cylinder1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
